In [1]:
#%run "../app/dreams"
from sys import path
path.insert(0,'../app')
from dreams import dreams_mastersheet


import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
from datetime import datetime

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
import pandas as pd

In [3]:
df = dreams_mastersheet

In [4]:
date_du_jour = datetime.today().strftime("%d_%m_%Y")

# La cohort des beneficaires

In [5]:
base = df[
    (df.age_range!="not_valid_age")
    &(df.age_range!="25-29")
]
base.code.count()
base_table = base.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
base_table

29864

fiscal_year,FY21Q1,FY21Q2,FY21Q3,FY21Q4,Q3fy20-Q4fy20,not_valid,Grand Total
age_range,,,,,,,
10-14,932,813,840,646,5050,2063,10344
15-19,1023,717,520,468,5380,4949,13057
20-24,522,359,255,212,2859,2256,6463
Grand Total,2477,1889,1615,1326,13289,9268,29864

In [6]:
base18plus = df[
    (df.newage_range!="not_valid_age")
    &(df.newage_range!="25-29")
    &(df.newage_range!="10-17")
]
base18plus.code.count()
base18plus_table = base18plus.pivot_table(index="newage_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
base18plus_table

11264

fiscal_year,FY21Q1,FY21Q2,FY21Q3,FY21Q4,Q3fy20-Q4fy20,not_valid,Grand Total
newage_range,,,,,,,
18-19,355,245,166,139,1808,2088,4801
20-24,522,359,255,212,2859,2256,6463
Grand Total,877,604,421,351,4667,4344,11264

# curriculum

In [7]:
curriculum_complet = base[
    (base.dreams_curriculum=="curriculum_completed")
]
curriculum_complet.code.count()

curriculum_table = curriculum_complet.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
curriculum_table

25198

fiscal_year,FY21Q1,FY21Q2,FY21Q3,FY21Q4,Q3fy20-Q4fy20,not_valid,Grand Total
age_range,,,,,,,
10-14,778,650,723,500,4369,1700,8720
15-19,860,567,470,376,4658,4003,10934
20-24,439,292,215,163,2527,1908,5544
Grand Total,2077,1509,1408,1039,11554,7611,25198

In [8]:
curriculum_inc = base[
    (base.dreams_curriculum=="curriculum_inc")
]
curriculum_inc.code.count()

curriculum_inc_table = curriculum_inc.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
curriculum_inc_table

4666

fiscal_year,FY21Q1,FY21Q2,FY21Q3,FY21Q4,Q3fy20-Q4fy20,not_valid,Grand Total
age_range,,,,,,,
10-14,154,163,117,146,681,363,1624
15-19,163,150,50,92,722,946,2123
20-24,83,67,40,49,332,348,919
Grand Total,400,380,207,287,1735,1657,4666

# Condoms

In [9]:
condoms = base[
    (base.condoms=="tested_on_given_date")
]

condoms.code.count()

new_condoms = base[
    (base.new_condoms=="sensOuRecu")
]

new_condoms.code.count()

5062

5678

In [10]:
condoms.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)

fiscal_year,FY21Q1,FY21Q2,FY21Q3,FY21Q4,Q3fy20-Q4fy20,not_valid,Grand Total
age_range,,,,,,,
10-14,91,109,85,44,308,140,777
15-19,321,180,179,174,1133,520,2507
20-24,263,106,103,104,942,260,1778
Grand Total,675,395,367,322,2383,920,5062

In [11]:
condoms_table = new_condoms.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
condoms_table

fiscal_year,FY21Q1,FY21Q2,FY21Q3,FY21Q4,Q3fy20-Q4fy20,not_valid,Grand Total
age_range,,,,,,,
10-14,104,119,137,89,355,172,976
15-19,355,227,213,200,1204,589,2788
20-24,282,135,115,105,969,308,1914
Grand Total,741,481,465,394,2528,1069,5678

# depistage VIH

In [12]:
vih = base[
    (base.hts=="tested_on_given_date")
]
vih.code.count()

3372

In [13]:
depistage_table = vih.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
depistage_table

fiscal_year,FY21Q1,FY21Q2,FY21Q3,FY21Q4,Q3fy20-Q4fy20,not_valid,Grand Total
age_range,,,,,,,
10-14,48,11,62,29,425,110,685
15-19,114,31,55,45,788,354,1387
20-24,180,34,64,49,731,242,1300
Grand Total,342,76,181,123,1944,706,3372

In [34]:
depistage_year = vih.pivot_table(index="age_range",columns="hts_fy",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
depistage_year

hts_fy,FY20Q2,FY20Q3,FY20Q4,FY21Q1,FY21Q2,FY21Q3,FY21Q4,Grand Total
age_range,,,,,,,,
10-14,4,20,419,4,0,19,219,685
15-19,45,39,738,5,4,32,524,1387
20-24,118,16,420,1,2,61,682,1300
Grand Total,167,75,1577,10,6,112,1425,3372

# Post Care Treatment

In [14]:
post_violence_care = base[
    (base.post_care_treatment=="service_gyneco_vbg")
]
post_violence_care.code.count()

228

In [15]:
pvc_table = post_violence_care.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
pvc_table

fiscal_year,FY21Q1,FY21Q2,FY21Q3,FY21Q4,Q3fy20-Q4fy20,not_valid,Grand Total
age_range,,,,,,,
10-14,3,0,0,0,17,9,29
15-19,6,4,1,3,66,24,104
20-24,5,2,0,0,76,12,95
Grand Total,14,6,1,3,159,45,228

# socio economique Approche

In [16]:
combin_socio_eco =  base[
    (base.socio_eco_app=="service_muso_gardening")
]

combin_socio_eco.code.count()

574

In [17]:
cse_table= combin_socio_eco.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
cse_table

fiscal_year  FY21Q1  FY21Q3  FY21Q4  Q3fy20-Q4fy20  not_valid  Grand Total
age_range
10-14             1       0       1            150         12          164
15-19             4       1       0            172         26          203
20-24             0       0       0            196         11          207
Grand Total       5       1       1            518         49          574

# PREP

In [18]:
prep_sens = base[
    (base.sens_prep=="tested_on_given_date")
]
prep_sens.code.count()

prep_sens_table = prep_sens.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_sens_table

1401

fiscal_year,FY21Q1,FY21Q2,FY21Q3,FY21Q4,Q3fy20-Q4fy20,not_valid,Grand Total
age_range,,,,,,,
10-14,20,10,40,18,69,16,173
15-19,77,25,79,39,250,69,539
20-24,143,28,68,44,380,26,689
Grand Total,240,63,187,101,699,111,1401

In [19]:
prep_accept = base[
    (base.acc_prep=="accept")
]
prep_accept.code.count()
prep_accept_table = prep_accept.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_accept_table

212

fiscal_year,FY21Q1,FY21Q2,FY21Q3,FY21Q4,Q3fy20-Q4fy20,not_valid,Grand Total
age_range,,,,,,,
10-14,0,0,0,0,8,0,8
15-19,8,0,1,3,68,12,92
20-24,13,3,1,3,86,6,112
Grand Total,21,3,2,6,162,18,212

In [20]:
prep_ref = base[
    (base.ref_prep=="tested_on_given_date")
]
prep_ref.code.count()
prep_ref_table = prep_ref.pivot_table(
                        index="age_range",
                        columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_ref_table

208

fiscal_year,FY21Q1,FY21Q2,FY21Q3,FY21Q4,Q3fy20-Q4fy20,not_valid,Grand Total
age_range,,,,,,,
10-14,0,0,0,1,8,0,9
15-19,8,0,1,2,66,12,89
20-24,11,3,1,3,87,5,110
Grand Total,19,3,2,6,161,17,208

In [21]:

prep = base[
    (base.init_prep=="tested_on_given_date")
]
prep.code.count()

prep_table = prep.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_table

185

fiscal_year,FY21Q1,FY21Q2,FY21Q3,FY21Q4,Q3fy20-Q4fy20,not_valid,Grand Total
age_range,,,,,,,
10-14,0,0,0,1,8,0,9
15-19,8,0,1,2,60,11,82
20-24,11,3,1,3,73,3,94
Grand Total,19,3,2,6,141,14,185

In [22]:

prep_accept[prep_accept.code.isin(prep_ref.code)].code.count()
prep_accept[~prep_accept.code.isin(prep_ref.code)].code.count()

accepter_non_referer = prep_accept[~prep_accept.code.isin(prep_ref.code)]

201

11

In [23]:
prep_ref[prep_ref.code.isin(prep_accept.code)].code.count()
prep_ref[~prep_ref.code.isin(prep_accept.code)].code.count()


ref_non_accept = prep_ref[~prep_ref.code.isin(prep_accept.code)]

201

7

In [24]:
prep_ref[prep_ref.code.isin(prep.code)].code.count()
prep_ref[~prep_ref.code.isin(prep.code)].code.count()

184

24

In [25]:
prep[prep.code.isin(prep_ref.code)].code.count()
prep[~prep.code.isin(prep_ref.code)].code.count()

184

1

In [26]:

search_missing_prep = pd.ExcelWriter(f"find_missing_prep.xlsx",engine="xlsxwriter")

accepter_non_referer.to_excel(search_missing_prep,sheet_name="accepter_non_referer",index=True,na_rep="NULL")
ref_non_accept.to_excel(search_missing_prep,sheet_name="ref_non_accept",index=True,na_rep="NULL")
search_missing_prep.save()

# jardinage

In [27]:


garden = base[
    (base.is_gardening=="yes")
]
garden.code.count()

garden_table = garden.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
garden_table

516

fiscal_year  FY21Q1  FY21Q3  FY21Q4  Q3fy20-Q4fy20  not_valid  Grand Total
age_range
10-14             1       0       1            145         12          159
15-19             4       1       0            159         21          185
20-24             0       0       0            162         10          172
Grand Total       5       1       1            466         43          516

# MUSO

In [28]:
muso = base[
    (base.is_muso=="yes")
]
muso.code.count()

muso_table = muso.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
muso_table

71

fiscal_year  Q3fy20-Q4fy20  not_valid  Grand Total
age_range
10-14                    5          0            5
15-19                   15          5           20
20-24                   45          1           46
Grand Total             65          6           71

# Primary Services

In [29]:
ps14 = base[
    (base.ps_10_14=="curriculum-servis")
]
ps14.code.count()

ps19 = base[
    (base.ps_15_19=="condoms&curriculum")
]
ps19.code.count()

ps24 = base[
    (base.ps_20_24=="condoms&curriculum")
]
ps24.code.count()

8720

2499

1723

In [30]:
ps14_table = ps14.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
ps14_table

fiscal_year,FY21Q1,FY21Q2,FY21Q3,FY21Q4,Q3fy20-Q4fy20,not_valid,Grand Total
age_range,,,,,,,
10-14,778,650,723,500,4369,1700,8720
Grand Total,778,650,723,500,4369,1700,8720

In [31]:

ps19_table= ps19.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
ps19_table

fiscal_year,FY21Q1,FY21Q2,FY21Q3,FY21Q4,Q3fy20-Q4fy20,not_valid,Grand Total
age_range,,,,,,,
15-19,327,186,205,154,1097,530,2499
Grand Total,327,186,205,154,1097,530,2499

In [32]:
ps24_table = ps24.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
ps24_table

fiscal_year,FY21Q1,FY21Q2,FY21Q3,FY21Q4,Q3fy20-Q4fy20,not_valid,Grand Total
age_range,,,,,,,
20-24,252,110,100,85,897,279,1723
Grand Total,252,110,100,85,897,279,1723

# reporting

In [33]:
table_report = pd.ExcelWriter(f"DREAMS_services_Quarter_enroled_{date_du_jour}.xlsx",engine="xlsxwriter")
ps14_table.to_excel(table_report,sheet_name="ps14_table",index=True,na_rep="NULL")
ps19_table.to_excel(table_report,sheet_name="ps19_table",index=True,na_rep="NULL")
ps24_table.to_excel(table_report,sheet_name="ps24_table",index=True,na_rep="NULL")
prep_table.to_excel(table_report,sheet_name="prep_table",index=True,na_rep="NULL")
prep_sens_table.to_excel(table_report,sheet_name="prep_sens_table",index=True,na_rep="NULL")
prep_sens_table.to_excel(table_report,sheet_name="prep_sens_table",index=True,na_rep="NULL")
prep_sens_table.to_excel(table_report,sheet_name="prep_sens_table",index=True,na_rep="NULL")
cse_table.to_excel(table_report,sheet_name="cse_table",index=True,na_rep="NULL")
pvc_table.to_excel(table_report,sheet_name="pvc_table",index=True,na_rep="NULL")
depistage_table.to_excel(table_report,sheet_name="depistage_table",index=True,na_rep="NULL")
condoms_table.to_excel(table_report,sheet_name="condoms_table",index=True,na_rep="NULL")
depistage_table.to_excel(table_report,sheet_name="depistage_table",index=True,na_rep="NULL")
curriculum_table.to_excel(table_report,sheet_name="curriculum_table",index=True,na_rep="NULL")
base_table.to_excel(table_report,sheet_name="base_table",index=True,na_rep="NULL")
table_report.save()